import 'package:azkar/models/Prayer.dart';
import 'package:azkar/models/SubCategorey.dart';
import 'package:azkar/models/Category.dart';
import 'package:flutter/material.dart';

const Color primaryTextColor = Color(0xff5774f2);
const Color secondaryTextColor = Color(0xff808080);
const Color backgroundColor = Color(0xfff2f2f2);
const Color unselectedColor = Color(0xffcdd6fb);
const Color purpleColor = Color(0xffb517ff);

List<Prayer> prayers = [
  Prayer(
    1,
    'للهمَّ مالكَ الملكِ تُؤتي الملكَ مَن تشاءُ ، وتنزعُ الملكَ ممن تشاءُ ، وتُعِزُّ مَن تشاءُ ، وتذِلُّ مَن تشاءُ ، بيدِك الخيرُ إنك على كلِّ شيءٍ قديرٌ . رحمنُ الدنيا والآخرةِ ورحيمُهما ، تعطيهما من تشاءُ ، وتمنعُ منهما من تشاءُ ، ارحمْني رحمةً تُغنيني بها عن رحمةِ مَن سواك'
        '(اللَّهمَّ ربَّ السَّمواتِ السَّبعِ، وربَّ العرشِ العظيمِ، ربَّنا وربَّ كلِّ شيءٍ، أنتَ الظَّاهرُ فليس فوقَكَ شيءٌ، وأنتَ الباطنُ فليس دونَكَ شيءٌ، مُنزِلَ التَّوراةِ، والإنجيلِ، والفُرقانِ، فالقَ الحَبِّ والنَّوى، أعوذُ بكَ مِن شرِّ كلِّ شيءٍ أنتَ آخِذٌ بناصيتِه، أنتَ الأوَّلُ فليس قبْلَكَ شيءٌ، وأنتَ الآخِرُ فليس بعدَكَ شيءٌ، اقضِ عنَّا الدَّينَ وأَغْنِنا مِن الفقرِ'
        'اللهمَّ إنِّي أعوذُ بك من الهمِّ والحزنِ، والعجزِ والكسلِ، والبُخلِ والجُبنِ، وضَلَعِ الدَّينِ، وغَلَبَةِ الرجالِ'
        'اللهمَّ إنِّي أعوذُ بك من التردِّي و الهدْمِ و الغرقِ و الحرقِ، و أعوذُ بك أن يتَخبطَني الشيطانُ عند الموتِ، و أعوذُ بك أن أموتَ في سبيلِك مُدْبرًا، و أعوذُ بك أن أموتَ لديغًا'
        'للهمَّ إنِّي أعوذُ بك من الجوعِ، فإنَّه بئْسَ الضجيعُ، و أعوذُ بك من الخيانةِ فإنَّها بئستُ البِطانةُ).(بسمِ اللَّهِ الَّذي لا يضرُّ معَ اسمِهِ شيءٌ في الأرضِ ولا في السَّماءِ، وَهوَ السَّميعُ العليمُ، ثلاثَ مرَّاتٍ'
        'للهُمَّ إني أَسْأَلُكَ العافيةَ في الدنيا والآخرةِ، اللهُمَّ إني أَسْأَلُكَ العَفْوَ والعافيةَ في دِينِي ودُنْيَايَ، وأهلي ومالي، اللهُمَّ اسْتُرْ عَوْراتِي وآمِنْ رَوْعاتِي، اللهُمَّ احْفَظْنِي من بينِ يَدَيَّ، ومن خلفي، وعن يميني، وعن شمالي، ومن فوقي، وأعوذ بعَظَمَتِكَ أنْ أُغْتالَ من تحتي'
        'للهُمَّ إني أَسْأَلُكَ العافيةَ في الدنيا والآخرةِ، اللهُمَّ إني أَسْأَلُكَ العَفْوَ والعافيةَ في دِينِي ودُنْيَايَ، وأهلي ومالي، اللهُمَّ اسْتُرْ عَوْراتِي وآمِنْ رَوْعاتِي، اللهُمَّ احْفَظْنِي من بينِ يَدَيَّ، ومن خلفي، وعن يميني، وعن شمالي، ومن فوقي، وأعوذ بعَظَمَتِكَ أنْ أُغْتالَ من تحتي',
    3,
    'هنا يوضع السند او المصدر سواء كان من القرآن او من الحديث,',
  ),
  Prayer(
    2,
    'هناك حقيقة مثبتة منذ زمن طويل وهي أن المحتوى المقروء لصفحة ما سيلهي القارئ عن التركيز على الشكل الخارجي للنص أو شكل توضع الفقرات في الصفحة التي يقرأها. ولذلك يتم استخدام طريقة لوريم إيبسوم لأنها تعطي توزيعاَ طبيعياَ -إلى حد ما- للأحرف عوضاً عن استخدام "هنا يوجد محتوى نصي، هنا يوجد محتوى نصي" فتجعلها تبدو (أي الأحرف) وكأنها نص مقروء وبرامح تحرير صفحات الويب تستخدم لوريم إيبسوم بشكل إفتراضي كنموذج عن النص، ',
    3,
    'هنا يوضع او المصدر سواء كان من القرآن او من الحديث,',
  ),
  Prayer(
    3,
    'هناك حقيقة مثبتة منذ زمن طويل وهي أن المحتوى المقروء لصفحة ما سيلهي القارئ عن التركيز على الشكل الخارجي للنص أو شكل توضع الفقرات في الصفحة التي يقرأها. ولذلك يتم استخدام طريقة لوريم إيبسوم لأنها تعطي توزيعاَ طبيعياَ -إلى حد ما- للأحرف عوضاً عن استخدام "هنا يوجد محتوى نصي، هنا يوجد محتوى نصي" فتجعلها تبدو (أي الأحرف) وكأنها نص مقروء. العديد من برامح النشر المكتبي وبرامح تحرير صفحات الويب تستخدم لوريم إيبسوم بشكل إفتراضي كنموذج عن النص، ',
    5,
    'هنا يوضع السند سواء كان من القرآن او من الحديث,',
  ),
  Prayer(
    4,
    'هناك حقيقة مثبتة منذ زمن طويل وهي أن المحتوى المقروء لصفحة ما سيلهي القارئ عن التركيز على الشكل الخارجي للنص أو شكل توضع الفقرات في الصفحة التي يقرأها. ولذلك يتم استخدام طريقة لوريم إيبسوم لأنها تعطي توزيعاَ طبيعياَ -إلى حد ما- للأحرف عوضاً عن استخدام "هنا يوجد . العديد من برامح النشر المكتبي وبرامح تحرير صفحات الويب تستخدم لوريم إيبسوم بشكل إفتراضي كنموذج عن النص، ',
    1,
    'هنا يوضع السند او المصدر سواء كان من القرآن او من الحديث,',
  ),
];

List<SubCategory> subCategory = [
  SubCategory(1, 'أذكار قبل الصلاة', prayers),
  SubCategory(2, 'أذكار بعد الصلاة', prayers),
];
List<Category> category = [
  Category(1, 'images/kaaba.png', 'أذكار الصلاة', subCategory),
  Category(2, 'images/kaaba.png', 'أذكار الصباح والمساء', subCategory),
];
List<SubCategory> favorite = [];
